tap "coursier/formulas"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jaredwideman/virt-manager"
tap "pomerium/tap"
brew "bison"
brew "bison@2.7"
brew "chezmoi"
brew "circleci"
brew "etcd", restart_service: true
brew "ghostscript"
brew "pkg-config"
brew "shared-mime-info"
brew "imagemagick"
brew "imagemagick@6"
brew "libyaml"
brew "zlib"
brew "mysql", restart_service: true
brew "openssl@1.1"
brew "postgresql@14"
brew "rbenv"
brew "redis"
brew "yq"
brew "coursier/formulas/coursier"
brew "derailed/k9s/k9s"
brew "pomerium/tap/pomerium-cli"
vscode "castwide.solargraph"
vscode "kaiwood.endwise"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "shopify.ruby-lsp"
