# Taps
tap "pomerium/tap"

# CLI Tools
brew "chezmoi"                   # Dotfiles manager
brew "circleci"                  # CircleCI CLI
brew "yq"                        # YAML processor
brew "derailed/k9s/k9s"          # Kubernetes CLI
brew "pomerium/tap/pomerium-cli" # Pomerium CLI
brew "wget"                      # Wget for picking up stuff

# Development Tools
brew "rbenv"                     # Ruby version manager
cask "ghostty"                   # New terminal
brew "docker"                    # Docker 
brew "kubectl"                   # Kubernetes
cask "jetbrains-toolbox"         # One stop-shop for Jetbrains product
brew "neovim"                    # neovim
brew "lazygit"                   # lazygit

# Services
brew "etcd", restart_service: true # Distributed key-value store
brew "mysql", restart_service: true # MySQL database
brew "redis"                     # Redis key-value store

# Utilities
brew "ghostscript"               # PDF and PostScript processor
brew "shared-mime-info"          # MIME type database
brew "imagemagick"               # Image processing
cask "betterdisplay"             # Display Manager
cask "rectangle"                 # Tiling Window Manager
cask "alt-tab"                   # alt-tab functionality
cask "maccy"                     # Clipboard Manager
cask "flameshot"                 # Screenshot tool
cask "discord"                   # Yeah
cask "zen"			 # Zen Browser

# Work stuff
cask "notion"
cask "slack"
cask "pritunl"
