# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "pomerium/tap"

# CLI Tools
brew "chezmoi"                   # Dotfiles manager
brew "circleci"                  # CircleCI CLI
brew "yq"                        # YAML processor
brew "derailed/k9s/k9s"          # Kubernetes CLI
brew "pomerium/tap/pomerium-cli" # Pomerium CLI

# Development Tools
brew "git"                       # Repo version manager
brew "rbenv"                     # Ruby version manager
brew "ghostty"                   # New terminal
brew "docker"                    # Docker 
brew "kubectl"                   # Kubernetes
brew "jetbrains-toolbox"         # One stop-shop for Jetbrains product
brew "neovim"                    # neovim
brew "lazygit"                   # lazygit

# Services
brew "etcd", restart_service: true # Distributed key-value store
brew "mysql", restart_service: true # MySQL database
brew "redis"                     # Redis key-value store

# Utilities
brew "ghostscript"               # PDF and PostScript processor
brew "shared-mime-info"          # MIME type database
brew "imagemagick"               # Image processing
brew "betterdisplay"             # Display Manager
brew "rectangle"                 # Tiling Window Manager
brew "alt-tab"                   # alt-tab functionality
brew "maccy"                     # Clipboard Manager
brew "flameshot"                 # Screenshot tool
brew "discord"                   # Yeah

# Work stuff
brew "notion"
brew "slack"
brew "pritunl"
